OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/passive/buoyantPenaltySimpleFoam/cases/3d_ref/0.org/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 323.5;

boundaryField
{
    solid_to_fluid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 323.5;
        kappaMethod     solidThermo;
        Tnbr            T;
    }
    walls
    {
        type            zeroGradient;
        value           uniform 398.5; //[K]
    }
    bottom
    {
        type            externalWallHeatFluxTemperature;
        kappaMethod     solidThermo;
        mode            flux;
        q{
           type         expression;
           expression   #{ sqrt(pow(pos().x(),2) + pow(pos().z(),2)) <= 5e-3 ? 3.305e5 : 0 #};
        };
        value           uniform 0;
    }
}


// ************************************************************************* //

