OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/passive/buoyantPenaltySimpleFoam/cases/3d_ref/constant/fluid/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          thermophysicalProperties.water;
}

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       18;
    }
    equationOfState
    {
        R               3000;
        rho             1027;
    }
    thermodynamics
    {
        Cp              4195;
        Hf              0;
    }
    transport
    {
        mu              0.00085;
        Pr              7;
    }
    solidProperties
    {
        Cp              100;
        kappa           10;
    }
}


// ************************************************************************* //
