OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/passive/buoyantPenaltySimpleFoam/cases/3d_ref/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

//libs            ( "libOpenFOAM.so" "libfieldFunctionObjects.so" );

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2500; //10000;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

profiling
{
    active          false;
    cpuInfo         false;
    memInfo         false;
    sysInfo         false;
}

functions
{
    #includeFunc patchAverage(T,name=outlet,region=fluid,log=true)
    #includeFunc fieldMinMax(T,region=solid)
    #includeFunc fieldMinMax(T,region=fluid)
}


// ************************************************************************* //
