OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/passive/buoyantPenaltySimpleFoam/cases/3d_ref/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;
    /*residualControl
    {
        p               1e-7;
        U               1e-7;
        "(k|epsilon|omega)" 1e-7;
    }*/
}
// ************************************************************************* //
